app/controllers/banners_controller.rb

SELECT * FROM "banners"
---
  def index
    @banners = Banner.all

SELECT * FROM "tipo_banners" WHERE ("tipo_banners"."id" = 1)
---
  def show
    @banner = Banner.find(params[:id])

SELECT * FROM "banners" WHERE ("banners"."id" = 1)
---
  def edit
    @banner = Banner.find(params[:id])

INSERT INTO "banners" ("created_at", "nome", "updated_at", "tipo_banner_id") VALUES('2010-12-04 13:09:14.451502', E'Teste', '2010-12-04 13:09:14.451502', 1) RETURNING "id"
---
  def create
    @banner = Banner.new(params[:banner])

    respond_to do |format|
      if @banner.save

SELECT * FROM "banners" WHERE ("banners"."id" = 1)
---
  def update
    @banner = Banner.find(params[:id])