app/controllers/categorias_controller.rb

SELECT * FROM "categorias"
---
  def index
    @categorias = Categoria.all

SELECT * FROM "categorias" WHERE ("categorias"."id" = 1)
---
  def show
    @categoria = Categoria.find(params[:id])

SELECT * FROM "categorias" WHERE ("categorias"."id" = 1)
---
  def edit
    @categoria = Categoria.find(params[:id])

INSERT INTO "categorias" ("created_at", "foto_file_size", "nome", "updated_at", "foto_content_type", "foto_file_name", "string", "descricao", "foto_updated_at", "datetime", "integer") VALUES('2010-11-09 23:51:25', 4578, 'Categoria 1', '2010-11-09 23:51:25', 'image/gif', 'restaurante.gif', NULL, 'Essa categoria e para restaurantes...', '2010-11-09 23:51:24', NULL, NULL)
---
  def create
    @categoria = Categoria.new(params[:categoria])

    respond_to do |format|
      if @categoria.save