app/controllers/mapas_controller.rb

  def index
    @mapas = Mapa.all
---
SELECT * FROM "mapas"

  def show
    @mapa = Mapa.find(params[:id])
---
SELECT * FROM "mapas" WHERE ("mapas"."id" = 1)

  def edit
    @mapa = Mapa.find(params[:id])
---
SELECT * FROM "mapas" WHERE ("mapas"."id" = 1)

  def create
    @mapa = Mapa.new(params[:mapa])

    respond_to do |format|
      if @mapa.save
---
INSERT INTO "mapas" ("latitude", "created_at", "nome", "updated_at", "longitude") VALUES(E'-38.476109', '2010-11-20 12:53:02.680928', E'Alvorada Embalagens', '2010-11-20 12:53:02.680928', E'-3.791782') RETURNING "id"

  def update
    @mapa = Mapa.find(params[:id])

    respond_to do |format|
      if @mapa.update_attributes(params[:mapa])
---
SELECT * FROM "mapas" WHERE ("mapas"."id" = 1)
UPDATE "mapas" SET "updated_at" = '2010-11-20 13:28:24.472669', "endereco" = E'Avenida Engenheiro Leal Lima verde, 410 - Água Fria' WHERE "id" = 1