app/controllers/marcas_controller.rb

  def index
    @marcas = Marca.all
---
SELECT * FROM "marcas" WHERE ("marcas".banner_id = 1)

  def show
    @marca = Marca.find(params[:id])
---
SELECT * FROM "marcas" WHERE ("marcas"."id" = 1)

  def edit
    @marca = Marca.find(params[:id])
---
SELECT * FROM "marcas" WHERE ("marcas".banner_id = 1)

  def create
    @marca = Marca.new(params[:marca])

    respond_to do |format|
      if @marca.save
---
INSERT INTO "marcas" ("created_at", "foto_file_size", "nome", "updated_at", "foto_content_type", "banner_id", "link", "foto_file_name", "string", "foto_updated_at", "datetime", "integer") VALUES('2010-11-20 13:39:20.778996', 17250, E'Art-Latex', '2010-11-20 13:39:20.778996', E'image/jpeg', NULL, E'', E'f_art_latex.jpg', NULL, '2010-11-20 13:39:19.757422', NULL, NULL) RETURNING "id"

  def update
    @marca = Marca.find(params[:id])

    respond_to do |format|
      if @marca.update_attributes(params[:marca])
---
SELECT * FROM "marcas" WHERE ("marcas"."id" = 2)
UPDATE "marcas" SET "updated_at" = '2010-11-18 22:26:18', "nome" = 'Art-Latex' WHERE "id" = 2

  def destroy
    @marca = Marca.find(params[:id])
    @marca.destroy
---
SELECT * FROM "marcas" WHERE ("marcas"."id" = 1)
DELETE FROM "marcas" WHERE "id" = 1