app/controllers/produtos_controller.rb

SELECT * FROM "produtos" WHERE ("produtos"."id" = 1)
---
  def show
    @produto = Produto.find(params[:id])

SELECT * FROM "produtos" WHERE ("produtos"."id" = 1)
---
  def edit
    @produto = Produto.find(params[:id])

INSERT INTO "produtos" ("created_at", "foto_file_size", "nome", "updated_at", "foto_content_type", "foto_file_name", "string", "descricacao", "foto_updated_at", "datetime", "marca_id", "integer") VALUES('2010-11-20 13:41:53.795753', 15648, E'Produto 01', '2010-11-20 13:41:53.795753', E'image/jpeg', E'balao.jpg', NULL, E'', '2010-11-20 13:41:53.381685', NULL, 1, NULL) RETURNING "id"
---
  def create
    @produto = Produto.new(params[:produto])

    respond_to do |format|
      if @produto.save

SELECT * FROM "produtos" WHERE ("produtos"."id" = 1)
UPDATE "produtos" SET "updated_at" = '2010-11-20 21:06:03.042186', "descricacao" = E'' WHERE "id" = 2
---
  def update
    @produto = Produto.find(params[:id])
    params[:produto][:categoria_ids] ||= []

    respond_to do |format|
      if @produto.update_attributes(params[:produto])