app/controllers/tipo_banners_controller.rb

SELECT * FROM "tipo_banners"
---
  def index
    @tipo_banners = TipoBanner.all

SELECT * FROM "tipo_banners" WHERE ("tipo_banners"."id" = 1)
---
  def show
    @tipo_banner = TipoBanner.find(params[:id])

INSERT INTO "tipo_banners" ("created_at", "nome", "updated_at") VALUES('2010-11-23 00:12:04.873384', E'Teste', '2010-11-23 00:12:04.873384') RETURNING "id"
---
  def create
    @tipo_banner = TipoBanner.new(params[:tipo_banner])

    respond_to do |format|
      if @tipo_banner.save