app/controllers/usuarios_controller.rb

SELECT * FROM "usuarios" WHERE ("usuarios"."id" = 4) LIMIT 1
---
  def show
    @usuario = Usuario.find(params[:id])

INSERT INTO "usuarios" ("name", "salt", "created_at", "crypted_password", "remember_token_expires_at", "updated_at", "remember_token", "login", "email") VALUES(E'', E'5484d001cc85fc7b1e8508e0320546b149758ced', '2010-11-22 22:32:32.496499', E'088f14f5fcd56358c288a9683ad3c42fb0d63b3c', NULL, '2010-11-22 22:32:32.496499', NULL, E'administrador', E'paulo@d7d.com.br') RETURNING "id"
---
  def create
    logout_keeping_session!
    @usuario = Usuario.new(params[:usuario])
    success = @usuario && @usuario.save

SELECT * FROM "usuarios" WHERE ("usuarios"."id" = 4) LIMIT 1
---
  def edit
      @usuario = Usuario.find(params[:id])

SELECT * FROM "usuarios" WHERE ("usuarios"."id" = 4)
UPDATE "usuarios" SET "updated_at" = '2010-11-23 02:20:20.379885', "name" = E'administrador' WHERE "id" = 4
---
  def update
    @usuario = Usuario.find(params[:id])

    respond_to do |format|
      if @usuario.update_attributes(params[:usuario])